testing_carga/artillery_ejem8/load-test.yml
config:
  target: "http://127.0.0.1:8080"
  environments:
    load:
      phases:
        - duration: 20
          arrivalRate: 10
      payload:
        path: "items.csv"
        fields:
          - "description"
          - "checked"
    functional:
      plugins:
        expect: {}
      phases:
        - duration: 1
          arrivalRate: 1
      variables:
        description:
          - "Leche"
        checked:
          - true

scenarios:
  - flow:
      - post:
          url: "/items/"
          json:
            description: "{{ description }}"
            checked: "{{ checked }}"
          capture:
            json: "$.id"
            as: "id"
          expect:
            - statusCode: 201
            - contentType: json
      - get:
          url: "/items/{{ id }}"
          capture:
            - json: "$.description"
              as: description_created
          expect:
            - statusCode: 200
            - contentType: json
            - equals:
                - "{{ description_created }}"
                - "{{ description }}"